#Рабочая Тетрадь 1 Задание 3.3.1
#Задание:Выведите числа из примера на while(3.2.1) в обратном порядке
for x in range(10,0,-3): print(x)