#Рабочая Тетрадь 1 Задание 3.3.2
#Задание: При решении задач машинного обучения часто в качестве объектов
#исследования выступает человек. Создайте список значимых
#характеристик (признаков), идентифицирующих человека. Выведите
#список на экран.

a = ['Пол','Адрес проживания','Имя','Фамилия','Образование','Профессия','Данные паспорта']
for x in a:
    print(x)
