#Рабочая Тетрадь 1 Задание 3.3.4
#Выведите числа из примера на for c функцией range() (3.2.4) в
#обратном порядке.

for i in range(105,4,-25): print(i)