#Рабочая тетрадь 1 Задание 3.3.3
#Создать список чисел от 2 до 15 с шагом 1.
a = [x for x in range(2,16)]
for i in a:
    print(i)