#Рабочая Тетрадь 2 Задание 1.3.3
#Задание: Создать массив 3x3x3 со случайными значениями.

import numpy as np

random_array = np.random.rand(3, 3, 3)

print(random_array)